# 웹프로그래밍의
# 데이터 1건 : dictionary
# 여러건 : list
# Create , Read Update Delete
# 키와 값의 pair
{"아이디":'spring','나이':25,'성인여부':True}
# 번호 , 제목 , 출판사 , 저자 , 출판일, 가격 
{'번호':1,'제목':"이것이 자바다",'출판사':"한빛미디어",'저자':"신용권",'출판일':"2022-09-05",'가격':36000}
# 키와 값의 pair로 정보를 표현 - > 딕셔너리
{'번호':1, '이름': '코카콜라','가격':2000,'재고':20}
# 딕셔너리로 list를 만든다
products=[
          {'번호':1, '이름': '코카콜라','가격':2000,'재고':20},
          {'번호':2, '이름': '펩시콜라','가격':1900,'재고':10}
]
print(products[0]['이름'])
print(products[1]['이름'])






# bunho=1
# irum='코카콜라'  < -  변수로 만들 때
# price=2000
# stock=20